##
import warnings

warnings.filterwarnings('ignore')
DEBUG = True
from other_function import clear_df

forma = 56
if forma == 55:
    base_path = [r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 (2015-2020гг)/2015 '
                 r'г/ФОРМА 55/для программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 (2015-2020гг)/2016 '
                 r'г/ФОРМА 55/для программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 (2015-2020гг)/2017 '
                 r'г/ФОРМА 55/для программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 '
                 r'(2015-2020гг)/2018 г/ФОРМА 55/для программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 '
                 r'(2015-2020гг)/2019 г/ФОРМА 55/для программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 '
                 r'(2015-2020гг)/2020 г/ФОРМА 55/для программы']
if forma == 56:
    base_path = [r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 (2015-2020гг)/2015'
                 r' г/ФОРМА 56/для_программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 (2015-2020гг)/2016 '
                 r'г/ФОРМА 56/для_программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 (2015-2020гг)/2017 '
                 r'г/ФОРМА 56/для_программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 '
                 r'(2015-2020гг)/2018 г/ФОРМА 56/для_программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 '
                 r'(2015-2020гг)/2019 г/ФОРМА 56/для_программы',
                 r'/media/maks/ntfs/Ирина/диссер статистика/Ф.55,56 (2015-2020гг)/Ф.55,56 '
                 r'(2015-2020гг)/2020 г/ФОРМА 56/для_программы']
print(base_path)
##
for x in base_path:
    clear_df(base_path=x, forma=forma)
##

